<a href="https://colab.research.google.com/github/parth1614/Machine_Learning/blob/main/PreProcessing_Transformation_Proximity_Corelation_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [15]:
import pandas as pd
import os 
from google.colab import files
#uploaded = files.upload() ##To upload files from your system
# dataframe = pd.read_csv("/content/AWCustomers.csv")
dataframe = pd.read_csv("AWCustomers.csv")
dataframe.info()
# type(dataframe)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   Title                 101 non-null    object
 2   FirstName             18361 non-null  object
 3   MiddleName            10572 non-null  object
 4   LastName              18361 non-null  object
 5   Suffix                3 non-null      object
 6   AddressLine1          18361 non-null  object
 7   AddressLine2          311 non-null    object
 8   City                  18361 non-null  object
 9   StateProvinceName     18361 non-null  object
 10  CountryRegionName     18361 non-null  object
 11  PostalCode            18361 non-null  object
 12  PhoneNumber           18361 non-null  object
 13  BirthDate             18361 non-null  object
 14  Education             18361 non-null  object
 15  Occupation            18361 non-null  object
 16  Gender                18361 non-null  object
 17  MaritalStatus         18361 non-null  object
 18  HomeOwnerFlag         18361 non-null  int64
 19  NumberCarsOwned       18361 non-null  int64
 20  NumberChildrenAtHome  18361 non-null  int64
 21  TotalChildren         18361 non-null  int64
 22  YearlyIncome          18361 non-null  int64
 23  LastUpdated           18361 non-null  object
dtypes: int64(6), object(18)
memory usage: 3.4+ MB

In [16]:
dataframe['BirthDate'] = pd.to_datetime(dataframe['BirthDate'])

import datetime 
CURRENT_TIME = datetime.datetime.now()
def get_age(birth_date, today = CURRENT_TIME):
  y = today - birth_date
  return y.days//365

dataframe['Age'] = dataframe['BirthDate'].apply(lambda x: get_age(x))
dataframe.drop(['BirthDate'], axis = 1, inplace=True)
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   Title                 101 non-null    object
 2   FirstName             18361 non-null  object
 3   MiddleName            10572 non-null  object
 4   LastName              18361 non-null  object
 5   Suffix                3 non-null      object
 6   AddressLine1          18361 non-null  object
 7   AddressLine2          311 non-null    object
 8   City                  18361 non-null  object
 9   StateProvinceName     18361 non-null  object
 10  CountryRegionName     18361 non-null  object
 11  PostalCode            18361 non-null  object
 12  PhoneNumber           18361 non-null  object
 13  Education             18361 non-null  object
 14  Occupation            18361 non-null  object
 15  Gender                18361 non-null  object
 16  MaritalStatus         18361 non-null  object
 17  HomeOwnerFlag         18361 non-null  int64
 18  NumberCarsOwned       18361 non-null  int64
 19  NumberChildrenAtHome  18361 non-null  int64
 20  TotalChildren         18361 non-null  int64
 21  YearlyIncome          18361 non-null  int64
 22  LastUpdated           18361 non-null  object
 23  Age                   18361 non-null  int64
dtypes: int64(7), object(17)
memory usage: 3.4+ MB

In [ ]:
df1 = pd.DataFrame(data = dataframe)
df2 = df1.loc[: , ['CustomerID' , 'Education' , 'Occupation' , 'Gender' , 'MaritalStatus' ,  'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome', 'YearlyIncome', 'Age']]
df2.head()

   CustomerID        Education  ... YearlyIncome Age
0       21173        Bachelors  ...        81916  33
1       13249  Partial College  ...        81076  49
2       29350        Bachelors  ...        86387  35
3       13503  Partial College  ...        61481  43
4       22803  Partial College  ...        51804  46

[5 rows x 10 columns]

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   Education             18361 non-null  object
 2   Occupation            18361 non-null  object
 3   Gender                18361 non-null  object
 4   MaritalStatus         18361 non-null  object
 5   HomeOwnerFlag         18361 non-null  int64
 6   NumberCarsOwned       18361 non-null  int64
 7   NumberChildrenAtHome  18361 non-null  int64
 8   YearlyIncome          18361 non-null  int64
 9   Age                   18361 non-null  int64
dtypes: int64(6), object(4)
memory usage: 1.4+ MB

In [ ]:
df2['Education'].value_counts()

Bachelors              5325
Partial College        5024
High School            3274
Graduate Degree        3163
Partial High School    1575
Name: Education, dtype: int64

In [ ]:
df2['Education'] = df2['Education'].map({'Partial High School' : 1, 'High School' : 2, 'Partial College' : 3, 'Bachelors' : 4, 'Graduate Degree' : 5})
df2['Occupation'].value_counts()

Skilled Manual    6059
Clerical          4464
Manual            3377
Management        2858
Professional      1603
Name: Occupation, dtype: int64

In [ ]:
df2['Occupation'] = df2['Occupation'].map({'Manual' : 1, 'Skilled Manual' : 2, 'Clerical' : 3, 'Management' : 4, 'Professional' : 5})

In [ ]:
def cardinal_columns(df):
  df['Gender'] = df['Gender'].map({'M' : 1, 'F' : 0})
  df['MaritalStatus'] = df['MaritalStatus'].map({'M' : 1, 'S' : 0})
  return df
df2 = cardinal_columns(df2)
df2.head()

   CustomerID  Education  Occupation  ...  NumberChildrenAtHome  YearlyIncome  Age
0       21173          4           3  ...                     0         81916   33
1       13249          3           3  ...                     1         81076   49
2       29350          4           3  ...                     0         86387   35
3       13503          3           2  ...                     1         61481   43
4       22803          3           2  ...                     0         51804   46

[5 rows x 10 columns]

In [ ]:
df2.isnull().sum()

CustomerID              0
Education               0
Occupation              0
Gender                  0
MaritalStatus           0
HomeOwnerFlag           0
NumberCarsOwned         0
NumberChildrenAtHome    0
YearlyIncome            0
Age                     0
dtype: int64

In [17]:
#from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import MinMaxScaler

In [18]:
def scale_down(df):
    scaler = MinMaxScaler()
    scaled = scaler.fit_transform(df[['YearlyIncome', 'Age']])
    df['YearlyIncomeScaled'] = scaled[:, 0] 
    df['AgeScaled'] = scaled[:, 1]
    df.drop(['YearlyIncome', 'Age'], axis = 1, inplace = True)
    return df

In [ ]:
df2 = scale_down(df2)

In [ ]:
from scipy.spatial import distance

In [ ]:
distance.cosine(df2['Education'].values, df2['YearlyIncomeScaled'].values)

0.12448913241018533

In [ ]:
distance.jaccard(df2['Education'].values, df2['YearlyIncomeScaled'].values)

1.0

In [ ]:
from scipy.stats import pearsonr
pearsonr(df2['Education'].values, df2['YearlyIncomeScaled'].values)[0]

0.46766483550548943